<a href="https://colab.research.google.com/github/Tiduzz/code_n_dump/blob/main/Modelo_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pacotes Necessários

In [65]:
import pandas as pd
import numpy as np

from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

# Lendo Banco de Dados

In [66]:
dados = pd.read_csv('/content/train.csv')

dados = dados.drop(['Name', 'Ticket', 'Cabin', 'Embarked'], axis=1)

dados.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

# Editando Chave e Variável Resposta

In [67]:
dados = dados.set_index(['PassengerId'])
dados = dados.rename(columns = {'Survived': 'target'}, inplace = False)

dados.head()

             target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                 0       3    male  22.0      1      0   7.2500
2                 1       1  female  38.0      1      0  71.2833
3                 1       3  female  26.0      0      0   7.9250
4                 1       1  female  35.0      1      0  53.1000
5                 0       3    male  35.0      0      0   8.0500

# Descritiva

In [68]:
dados.describe()

dados.describe(include=['O'])

         Sex
count    891
unique     2
top     male
freq     577

# Transformação dos dados

In [69]:
dados['Sex_F'] = np.where(dados['Sex'] == 'female', 1, 0)

dados['Pclass_1'] = np.where(dados['Pclass'] == 1, 1, 0)
dados['Pclass_2'] = np.where(dados['Pclass'] == 2, 1, 0)
dados['Pclass_3'] = np.where(dados['Pclass'] == 3, 1, 0)

In [70]:
dados = dados.drop(['Pclass', 'Sex'], axis = 1)

dados.fillna(0, inplace = True)

dados.isnull().sum()

target      0
Age         0
SibSp       0
Parch       0
Fare        0
Sex_F       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

# Amostragem

In [71]:
x_train, x_test, y_train, y_test = train_test_split(dados.drop(['target'], axis = 1),
                                                    dados['target'],
                                                    test_size = 0.3,
                                                    random_state = 1234)

[{'treino': (623, 8)}, {'teste': (268, 8)}]

[{'treino': (623, 8)}, {'teste': (268, 8)}]

# Modelo

In [72]:
rndforest = RandomForestClassifier(n_estimators= 1000,
                                      criterion='gini',
                                      max_depth = 5)

rndforest.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [73]:
probabilidade = rndforest.predict_proba(dados.drop('target', axis=1))[:,1]
classificacao = rndforest.predict(dados.drop('target',axis=1))

In [74]:
dados['probabilidade'] = probabilidade
dados['classificacao'] = classificacao

In [75]:
dados

             target   Age  SibSp  ...  Pclass_3  probabilidade  classificacao
PassengerId                       ...
1                 0  22.0      1  ...         1       0.123939              0
2                 1  38.0      1  ...         0       0.936094              1
3                 1  26.0      0  ...         1       0.445038              0
4                 1  35.0      1  ...         0       0.924118              1
5                 0  35.0      0  ...         1       0.134014              0
...             ...   ...    ...  ...       ...            ...            ...
887               0  27.0      0  ...         0       0.131685              0
888               1  19.0      0  ...         0       0.860455              1
889               0   0.0      1  ...         1       0.479379              0
890               1  26.0      0  ...         0       0.450019              0
891               0  32.0      0  ...         1       0.160265              0

[891 rows x 11 columns]